---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotPickHereInCurrentView
source: html/441ff7ff-4b12-3460-3e1c-f0c5f6be0a26.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotPickHereInCurrentView Property

Can't pick here at this view angle. Set another Work Plane or adjust the view.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPickHereInCurrentView { get; }
```